Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
/* 
 * File:   sensepi_cam_trigger.c
 * Copyright (c) 2018 Appiko
 * Created on 1 June, 2018, 3:30 PM
 * Author: Tejas Vasekar (https://github.com/tejas-tj)
 * All rights reserved.
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 * this list of conditions and the following disclaimer in the documentation
 * and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its contributors
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF 
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE
 */

#include "sensepi_cam_trigger.h"

#include "sensepi_ble.h"

#include "pir_sense.h"
#include "led_sense.h"
#include "log.h"
#include "device_tick.h"
#include "mcp4012_x.h"
#include "ms_timer.h"
#include "out_pattern_gen.h"

#include "boards.h"

#include "hal_pin_analog_input.h"
#include "hal_nop_delay.h"
#include "hal_gpio.h"
#include "nrf_util.h"
#include "common_util.h"

#include "stdint.h"
#include "stdbool.h"
#include "string.h"
#include "nrf_assert.h"

/*Make this 1 while doing debugging over UART*/
#define DEBUG_PRINT 1

/*Sensepi_PIR module MACROS*/
/**Delay required when LED is to be used as INPUT*/
#define LED_WAIT_TIME_MS 301
/**Minimum time required to enable PIR sensing*/
#define PIR_SENSE_INTERVAL_MS 50
/***/
#define PIR_SENSE_THRESHOLD 600
/** Multiplying factor to convert PIR threshold value received from app to one 
 *  appropriate for module
 */
#define PIR_THRESHOLD_MULTIPLY_FACTOR 8
/** Multiplying factor to convert Light threshold value received from app to one 
 *  appropriate for module
 */
#define LIGHT_THRESHOLD_MULTIPLY_FACTOR 32

/*Data_Process module MACROS*/

#define SIZE_OF_BYTE 8
#define POS_OF_MODE 0
#define POS_OF_INPUT1 1
#define POS_OF_INPUT2 3
#define MODE_MSK 0x000000FF
#define INPUT1_MSK 0x00FFFF00
#define INPUT2_MSK 0xFF000000

#define NUM_PIN_OUT 2
#define FOCUS_TRIGGER_TIME_DIFF LFCLK_TICKS_MS(20)
#define SINGLE_SHOT_TRANSITIONS 2
#define BULB_SHOT_TRANSITIONS 3
#define SINGLE_SHOT_DURATION LFCLK_TICKS_MS(250)
#define BULB_TRIGGER_PULSE LFCLK_TICKS_MS(250)
#define VIDEO_TRANSITION 2
#define VIDEO_CONTROL_PULSE LFCLK_TICKS_MS(250)
#define FOCUS_TRANSITIONS 2


/*SensePi_PIR module variables.*/
/**Copy of configuration to be shared across module*/
static sensepi_cam_trigger_init_config_t config;
/**PIR configuration which will be used to enable PIR*/
static pir_sense_cfg config_pir;
/**minimum inter-trigger time between two successive trigger*/
static uint32_t intr_trig_time_in = 0;
/**Timer duration after which timer interrupt will occur*/
static uint32_t timer_interval_in = 0;
/**Extension time which has to be added after PIR interrupt occur*/
static uint32_t video_ext_time = 0;
/**Flag to keep status of video*/
static bool video_on_flag = false;
/**Flag to keep status of PIR operation*/
static bool pir_oper_flag = false;
/**Flag to keep status of PIR's current state*/
static bool pir_on_flag = false;
/**Flag to keep status of TIMER's current state*/
static bool timer_on_flag = false;
/**Time remain in video length*/
static uint32_t time_remain = 0;
/***/
static const bool out_gen_end_all_on[OUT_GEN_MAX_NUM_OUT] = {1,1,1,1};
/***/
static const bool multishot_generic[OUT_GEN_MAX_NUM_OUT][OUT_GEN_MAX_TRANSITIONS] =
    {
            {0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1},
            {0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1},
            {0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1},
            {0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1}
    };

/**
 * @brief Enum to decide the Mode for data processing. 
 */
typedef enum 
{
    /** Do data process according to PIR configuration */
    PIR_DATA_PROCESS_MODE,
    /** Do data process according to TIMER configuration */
    TIMER_DATA_PROCESS_MODE,
}
data_process_mode_t;

/**
 * @brief Enum of different types of camera triggering.
 */
typedef enum 
{
    /** Click single shot per trigger */
    MODE_SINGLE_SHOT,
    /** Click multiple shot per trigger */
    MODE_MULTISHOT,
    /** Clicl shot in bulb mode */
    MODE_BULB,
    /** Click video according to configuration */
    MODE_VIDEO,
    /** Focus only */
    MODE_FOCUS,
} 
operational_mode_t;

/** 
 * @brief Enum of different states of camera trigger
 */
typedef enum
{
    IDLE,
    VIDEO_PIR_ON,
    VIDEO_END,
    VIDEO_TIMER,
}
cam_trig_state_t;

/**
 * @brief Local function used to start the operation of module internally.
 */
void start_sense();

/**
 * @brief Function to enable PIR sensing
 */
void pir_enable();

/**
 * @brief Function to disable PIR sensing
 */
void pir_disable();

/**
 * @brief IRQ Handler for PIR interrupt
 */
void pir_handler(int32_t adc_val);
/**
 * @brief Function to enable timer
 */
void timer_enable();

/**
 * @brief Function to disable timer
 */
void timer_disable();

/**
 * @brief IRQ Handler for TIMER interrupt
 */
void timer_handler(void);

/**
 * @brief Function to enable LED sensing with proper parameters.
 * @param led_conf Configuration which is to be used to activate LED light 
 * sensing
 */
void led_sense_conf(sensepi_cam_trigger_init_config_t * led_conf);

/**
 * @brief Function to check light conditions and comapre light conditions with 
 * configuration provided by user.
 * @param oper_time_temp Local copy of oper_time to select light condition
 * configuration
 * @return if light conditions satisfies the conditions provided by config
 * return 1, else retunr 0.
 */
bool light_check(oper_time_t oper_time_temp);

/**
 * @brief Function which is to be called to generate and send output pattern
 * @param data_process_mode boolean value to select from which configuration
 * mode has to be selected
 */
void data_process_pattern_gen(bool data_process_mode);

/**
 * @brief Function to get extension value for video in case of PIR trigger.
 * @return Extention time
 */
uint32_t data_process_get_video_extention(void);

/**
 * @brief Functions to generate patterns according to selected camera trigger
 * mode.
 * @{
 */
/**
 * @brief Function to click one shot per trigger
 */
void single_shot_mode();
/**
 * @brief Function to click multiple shots per trigger
 * @param burst_duration Time duration between two shots
 * @param burst_num Number of shots per trigger
 */
void multi_shot_mode(uint32_t burst_duration, uint32_t burst_num);
/**
 * @brief Function to take photo in bulb mode.
 * @param bulb_time Time duration for half press signal
 */
void bulb_mode(uint32_t bulb_time);
/**
 * @brief Function to take video according to configuration
 * @param video_time Minimum Duration for footage.
 */
void video_mode(uint32_t video_time);
/**
 * @brief Function to do focus only
 */
void focus_mode();
/**
 * @}
 */

/**
 * @brief Handler for out pattern generation done.
 * @param out_gen_state State from which handler is called.
 */
void pattern_out_done_handler(uint32_t out_gen_state);

