Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
///Function definitions

void debug_print_bool_array(bool (* next)[OUT_GEN_MAX_TRANSITIONS], char * str)
{
#if DEBUG_PRINT
    log_printf("%s\n", str);
    for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
    {
        for(uint32_t arr_p = 0; arr_p<OUT_GEN_MAX_TRANSITIONS; arr_p++)
        {
            log_printf("%x ", next[row][arr_p]);
        }
        log_printf("\n");
    }
    log_printf("\n");
#endif
}

/*SensePi_PIR module*/
void pir_enable()
{
    log_printf("PIR_Enabled\n");
    if(pir_on_flag == false)
    {
        pir_on_flag = true;
        pir_sense_start(&config_pir);
    }
}

void pir_disable()
{
    log_printf("PIR_Disabled\n");
    pir_on_flag = false;
    pir_sense_stop();
}

void pir_handler(int32_t adc_val)
{
    log_printf("Sensed %d\n", adc_val);
    pir_disable();
    out_gen_stop((bool *) out_gen_end_all_on);
    pir_oper_flag = true;
    if(video_on_flag == true && time_remain > 0)
    {
        time_remain -= out_gen_get_ticks();
        out_gen_config_t video_end_out_gen_config = 
        {
            .num_transitions = 1,
            .out_gen_done_handler = pattern_out_done_handler,
            .out_gen_state = VIDEO_PIR_ON,
            .transitions_durations = {video_ext_time},
            .next_out =  {{1,1},
            {1,1}},
            
        };
        out_gen_start(&video_end_out_gen_config);

        debug_print_bool_array(video_end_out_gen_config.next_out, "Pir handler");
    }
    else
    {
        data_process_pattern_gen(PIR_DATA_PROCESS_MODE);        
    }
}

void timer_enable()
{
    log_printf("TIMER_Enabled\n");
    if(timer_on_flag == false)
    {
        timer_on_flag = true;
        ms_timer_start(MS_TIMER2,
            MS_REPEATED_CALL, LFCLK_TICKS_MS(timer_interval_in), timer_handler);
    }
}

void timer_disable()
{
    log_printf("TIMER_Disabled\n");
    timer_on_flag = false;
    ms_timer_stop(MS_TIMER2);
}

void timer_handler(void)
{
    log_printf("Timer Handler\n");
    if(pir_oper_flag == false)
    {
        data_process_pattern_gen(TIMER_DATA_PROCESS_MODE);    
    }
}

void led_sense_conf(sensepi_cam_trigger_init_config_t * led_conf)
{
    log_printf("Led_Sense_Conf\n");
    led_sense_init(led_conf->led_sense_out_pin,
            led_conf->led_sense_analog_in_pin,
            led_conf->led_sense_off_val);
}

bool light_check(oper_time_t oper_time_temp)
{
    log_printf("Light intensity : %d\n", led_sense_get());
    static uint8_t light_sense_config = 1;
    static uint32_t light_threshold = 0;
    static uint32_t light_intensity = 0;
    light_intensity = led_sense_get();
    static bool light_check_flag = 0;
    light_sense_config = oper_time_temp.day_or_night;
    light_threshold = (uint32_t)((oper_time_temp.threshold) * LIGHT_THRESHOLD_MULTIPLY_FACTOR);
    if(light_sense_config == 1 && light_intensity >= light_threshold)
    {
        light_check_flag = 1;
    }
    else if(light_sense_config == 0 && light_intensity <= light_threshold)
    {
        light_check_flag = 1;
    }
    else
    {
        light_check_flag = 0;
    }
    return light_check_flag;
}


void start_sense()
{
    uint32_t working_mode = 0;
    working_mode = config.config_sensepi->trig_conf;
    switch(working_mode)
    {
        case PIR_ONLY:
        {
            if(light_check(config.config_sensepi->pir_conf.oper_time) == true)
            {
                pir_enable();
            }
            else
            {
                pir_disable();
            }
            break;
        }
        case TIMER_ONLY:
        {
            if(light_check(config.config_sensepi->timer_conf.oper_time) == true)
            {
                timer_enable();
            }
            else
            {
                timer_disable();
            }
            break;
        }
        //TODO make an internal config for the oper time
        case PIR_AND_TIMER:
        {
            if(light_check(config.config_sensepi->pir_conf.oper_time) == true)
            {
                pir_enable();
            }
            else
            {
                pir_disable();
            }
            if(light_check(config.config_sensepi->timer_conf.oper_time) == true)
            {
                timer_enable();
            }
            else
            {
                timer_disable();
            }
            break;
        }

    }

}

void sensepi_cam_trigger_start()
{
    led_sense_cfg_input(true);
    hal_nop_delay_ms(LED_WAIT_TIME_MS);
    //This if will check if module is already working or not.
    start_sense();
}

void sensepi_cam_trigger_stop()
{
    log_printf("SensePi_PIR_Stop\n");
    led_sense_cfg_input(false);
    pir_disable();
    timer_disable();
    out_gen_stop((bool *) out_gen_end_all_on);
    return;
}

void sensepi_cam_trigger_init(sensepi_cam_trigger_init_config_t * config_sensepi_cam_trigger)
{
    uint32_t working_mode = 0;
    log_printf("SensePi_PIR_init\n");
    ASSERT(config_sensepi_cam_trigger->signal_pin_num == NUM_PIN_OUT);
    memcpy(&config, config_sensepi_cam_trigger, sizeof(config));
    sensepi_config_t local_sensepi_config_t;
    memcpy(&local_sensepi_config_t, config.config_sensepi,sizeof(local_sensepi_config_t));
    led_sense_conf(&config);
    working_mode = local_sensepi_config_t.trig_conf;
    switch(working_mode)
    {
        case PIR_ONLY:
        {
            pir_sense_cfg local_config_pir = 
            {
                PIR_SENSE_INTERVAL_MS, config.pir_sense_signal_input,
                config.pir_sense_offset_input,
                ((uint32_t)local_sensepi_config_t.pir_conf.threshold)*PIR_THRESHOLD_MULTIPLY_FACTOR,
                APP_IRQ_PRIORITY_HIGH, pir_handler, 
            };
            config_pir = local_config_pir;
            intr_trig_time_in = (local_sensepi_config_t.pir_conf.intr_trig_timer)*100;
            mcp4012_init(config.amp_cs_pin, config.amp_ud_pin, config.amp_spi_sck_pin);
            mcp4012_set_value(config_sensepi_cam_trigger->config_sensepi->pir_conf.amplification);
            break;
        }
        case TIMER_ONLY:
        {
            timer_interval_in = (local_sensepi_config_t.timer_conf.timer_interval) * 100;
            break;
        }
        case PIR_AND_TIMER:
        {
            pir_sense_cfg local_config_pir = 
            {
                PIR_SENSE_INTERVAL_MS, config.pir_sense_signal_input,
                config.pir_sense_offset_input,
                ((uint32_t)local_sensepi_config_t.pir_conf.threshold)*PIR_THRESHOLD_MULTIPLY_FACTOR,
                APP_IRQ_PRIORITY_HIGH, pir_handler, 
            };
            config_pir = local_config_pir;
            intr_trig_time_in = (local_sensepi_config_t.pir_conf.intr_trig_timer)*100;
            mcp4012_init(config.amp_cs_pin, config.amp_ud_pin, config.amp_spi_sck_pin);
            mcp4012_set_value(config_sensepi_cam_trigger->config_sensepi->pir_conf.amplification);
            timer_interval_in = (local_sensepi_config_t.timer_conf.timer_interval) * 100;
            break;
        }
    }

    out_gen_init(NUM_PIN_OUT, config.signal_out_pin_array, (bool *) out_gen_end_all_on);
    out_gen_stop((bool *) out_gen_end_all_on);
    return;
}

void sensepi_cam_trigger_update(sensepi_config_t * update_config)
{
    uint32_t working_mode = 0;
    log_printf("SensePi_PIR_update\n");
    memcpy(config.config_sensepi, update_config, sizeof(sensepi_config_t));
    working_mode = config.config_sensepi->trig_conf;
    switch((trigger_conf_t)working_mode)
    {
        case PIR_ONLY:
        {
            config_pir.threshold = ((uint32_t) config.config_sensepi->pir_conf.threshold)
                    *PIR_THRESHOLD_MULTIPLY_FACTOR;
            mcp4012_set_value(config.config_sensepi->pir_conf.amplification);
            intr_trig_time_in = ((uint32_t)config.config_sensepi->pir_conf.intr_trig_timer)*100;
            intr_trig_time_in = LFCLK_TICKS_MS(intr_trig_time_in);
            break;
        }
        case TIMER_ONLY:
        {
            timer_interval_in = (config.config_sensepi->timer_conf.timer_interval) * 100;
            break;
        }
        case PIR_AND_TIMER:
        {
            config_pir.threshold = ((uint32_t) config.config_sensepi->pir_conf.threshold)
                    *PIR_THRESHOLD_MULTIPLY_FACTOR;
            mcp4012_set_value(config.config_sensepi->pir_conf.amplification);
            intr_trig_time_in = ((uint32_t)config.config_sensepi->pir_conf.intr_trig_timer)*100;
            intr_trig_time_in = LFCLK_TICKS_MS(intr_trig_time_in);
            timer_interval_in = (config.config_sensepi->timer_conf.timer_interval) * 100;
            break;
        }
    }
}

void sensepi_cam_trigger_add_tick(uint32_t interval)
{
    log_printf("SensePi Add ticks : %d\n", interval);
    //TODO Take care of this if
    //NOTE if this if() removed then state switching does not happen
//    if(interval > 51)
//    {
        start_sense();
//    }
}

/*Data_Process module*/

void pattern_out_done_handler(uint32_t out_gen_state)
{
    log_printf("OUT_GEN_STATE : %02x\n", out_gen_state);

    switch((cam_trig_state_t)out_gen_state)
    {
        case IDLE:
        {
            if(false == (config.config_sensepi->trig_conf == TIMER_ONLY))
            {
                pir_enable();
                if(pir_oper_flag == true)
                {
                    pir_oper_flag = false;
                }
            }
            break;
        }
        case VIDEO_PIR_ON:
        {
            video_on_flag = true;
            pir_enable();
            out_gen_config_t video_end_out_gen_config = 
            {
                .num_transitions = 2,
                .out_gen_done_handler = pattern_out_done_handler,
                .out_gen_state = VIDEO_END,
                .transitions_durations =
                    {time_remain, VIDEO_CONTROL_PULSE},
                .next_out = 
                    {{1,0,1},
            {1,1,1}},
            };
            out_gen_start(&video_end_out_gen_config);
            debug_print_bool_array(video_end_out_gen_config.next_out,
                    "Pattern done video start");
            break;
        }
        case VIDEO_END:
        {
            video_on_flag = 0;
            pir_enable();
            break;
        }
        case VIDEO_TIMER:
        {
            break;
        }
    }
    return;
}

sensepi_config_t * sensepi_cam_trigger_get_sensepi_config_t()
{
    log_printf("SensePi_PIR_get_config\n");
    return (config.config_sensepi);
}

uint32_t data_process_get_video_extention (void)
{
    return (uint32_t)config.config_sensepi->pir_conf.intr_trig_timer * 100;
}

void single_shot_mode()
{
    log_printf("SINGLE_SHOT_MODE\n");
    uint32_t number_of_transition = SINGLE_SHOT_TRANSITIONS;

    time_remain = intr_trig_time_in - (SINGLE_SHOT_DURATION);

    out_gen_config_t out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = IDLE,
        .transitions_durations = { SINGLE_SHOT_DURATION, time_remain },
        .next_out = {{0, 1, 1},
                     {0, 1, 1}},
    };

    debug_print_bool_array(out_gen_config.next_out, "single shot");
    out_gen_start(&out_gen_config);  
}

void multi_shot_mode(uint32_t burst_duration, uint32_t burst_num)
{
    uint32_t number_of_transition = SINGLE_SHOT_TRANSITIONS * burst_num;
    log_printf("MULTISHOT MODE\n");
    //Time for trigger pulse and time till next trigger for each burst
    uint32_t repeat_delay_array[SINGLE_SHOT_TRANSITIONS] = {SINGLE_SHOT_DURATION,
            LFCLK_TICKS_MS(burst_duration * 100) - SINGLE_SHOT_DURATION};
    out_gen_config_t out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = IDLE,
    };

