Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
    for(uint32_t i = 0; i< burst_num; i++)
    {
        memcpy(out_gen_config.transitions_durations + i*SINGLE_SHOT_TRANSITIONS,
                repeat_delay_array, SINGLE_SHOT_TRANSITIONS*sizeof(uint32_t));

        for(uint32_t j = 0; j < NUM_PIN_OUT; j++)
        {
            memcpy(*(out_gen_config.next_out +j),*(multishot_generic + j),
                    burst_num* SINGLE_SHOT_TRANSITIONS*sizeof(bool));
            //An extra '1' at the end for the remaining of the inter-trigger time
            out_gen_config.next_out[j][burst_num* SINGLE_SHOT_TRANSITIONS] = 1;
        }
    }

    // Last interval for the '1' signal till 'time till next trigger' elapses
    out_gen_config.transitions_durations[number_of_transition-1] =
            intr_trig_time_in - SINGLE_SHOT_DURATION*burst_num -
            (LFCLK_TICKS_MS(burst_duration * 100) - SINGLE_SHOT_DURATION)*(burst_num - 1);

    debug_print_bool_array(out_gen_config.next_out, "multi shot");

#if DEBUG_PRINT
    for(uint32_t i = 0; i<number_of_transition; i++)
    {
        log_printf(": %d", out_gen_config.transitions_durations[i]);
    }
#endif
    out_gen_start(&out_gen_config);
}

void bulb_mode(uint32_t bulb_time)
{
    log_printf("BULB_MODE\n");
    uint32_t number_of_transition = BULB_SHOT_TRANSITIONS;
    uint32_t bulb_time_ticks = LFCLK_TICKS_MS((bulb_time*100));
    out_gen_config_t out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = IDLE,
        .transitions_durations =
            {bulb_time_ticks - BULB_TRIGGER_PULSE, BULB_TRIGGER_PULSE
              , intr_trig_time_in - bulb_time_ticks},
        .next_out = { {0, 0, 1, 1},
                      {1, 0, 1, 1} },
    };

    debug_print_bool_array(out_gen_config.next_out, "bulb mode");

    out_gen_start(&out_gen_config);
}

void video_mode(uint32_t video_time)
{
    log_printf("VIDEO_MODE\n");

    //With PIR
    if(false == (config.config_sensepi->trig_conf == TIMER_ONLY))
    {
        video_ext_time = data_process_get_video_extention();
        video_ext_time = LFCLK_TICKS_MS(video_ext_time);
        uint32_t video_pir_disable_len = LFCLK_TICKS_MS((video_time * 100)) -
                video_ext_time;
        out_gen_config_t out_gen_config =
        {
            .num_transitions = VIDEO_TRANSITION,
            .out_gen_done_handler = pattern_out_done_handler,
            .out_gen_state = VIDEO_PIR_ON,
            .transitions_durations =
            {VIDEO_CONTROL_PULSE, (video_pir_disable_len)},
            .next_out = {{0,1,1},
                         {1,1,1}},
        };

        time_remain = video_ext_time;
        debug_print_bool_array(out_gen_config.next_out, "video PIR mode");

        out_gen_start(&out_gen_config);
    }
    //Only Timer
    else
    {
        uint32_t time_left = timer_interval_in - ((video_time * 100) - 500);
        log_printf("time remain: %d\n",time_left);
        time_left = LFCLK_TICKS_MS(time_left);

        out_gen_config_t out_gen_config =
        {
            .num_transitions = VIDEO_TRANSITION * 2,
            .out_gen_done_handler = pattern_out_done_handler,
            .out_gen_state = VIDEO_TIMER,
            .transitions_durations = {VIDEO_CONTROL_PULSE,
                LFCLK_TICKS_MS(video_time*100), VIDEO_CONTROL_PULSE, time_left},
            .next_out = {{0, 1, 0, 1, 1},
                         {1, 1, 1, 1, 1}},
        };

        debug_print_bool_array(out_gen_config.next_out, "video timer mode");

        out_gen_start(&out_gen_config);
    }
}

void focus_mode()
{
    log_printf("FOCUS_MODE\n");
    uint32_t number_of_transition = FOCUS_TRANSITIONS;
    out_gen_config_t out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = IDLE,
        .transitions_durations =
        {SINGLE_SHOT_DURATION , intr_trig_time_in - SINGLE_SHOT_DURATION},
        .next_out = { {0, 1, 1},
                      {1, 1, 1} },
    };
    
    debug_print_bool_array(out_gen_config.next_out, "focus mode");
    
    out_gen_start(&out_gen_config);

}

void data_process_pattern_gen(bool data_process_mode)
{
    log_printf("Pattern_Generation\n");
    uint32_t config_mode;

    if((data_process_mode_t)data_process_mode == PIR_DATA_PROCESS_MODE)
    {
        config_mode = config.config_sensepi->pir_conf.mode;
    }
    else
    {
        config_mode = config.config_sensepi->timer_conf.mode;
    }
    out_gen_stop((bool *) out_gen_end_all_on);
    uint32_t mode = ((config_mode & MODE_MSK) 
            >> (POS_OF_MODE * SIZE_OF_BYTE));
    uint32_t input1 = ((config_mode & INPUT1_MSK) 
            >> (POS_OF_INPUT1 * SIZE_OF_BYTE));
    uint32_t input2 = ((config_mode & INPUT2_MSK) 
            >> (POS_OF_INPUT2 * SIZE_OF_BYTE));
    uint32_t single_input = config_mode>> (POS_OF_INPUT1 * SIZE_OF_BYTE);
#if DEBUG_PRINT
    log_printf("Mode : %02x\n", mode);
    log_printf("Input 1 : %06d\n", input1);
    log_printf("input 2 : %02x\n", input2);
#endif
    switch((operational_mode_t)mode)
    {
        case MODE_SINGLE_SHOT:
        {
            single_shot_mode();
            break;
        }
        case MODE_MULTISHOT:
        {
            multi_shot_mode(input1, input2);
            break;
        }
        case MODE_BULB :
        {
            //Using both input 1 and input 2
            bulb_mode(single_input);
            break;
        }
        case MODE_VIDEO :
        {
            //Using both input 1 and input 2
            video_mode(single_input);
            break;
        }
        case MODE_FOCUS :
        {
            focus_mode();
            break;
        }
    }   
    return;        
}
